[
    {
        "image": "https://i.ibb.co.com/4ng87kWK/task-master.webp",
        "title": "TaskMaster",
        "companyName": "EfficientWorks",
        "id": 1,
        "description": "TaskMaster is the ultimate productivity app for managing your daily workflow. Create tasks with deadlines, priorities, and categories to stay organized. Track progress visually with Kanban boards, lists, or calendar views. Collaborate with team members by assigning tasks, adding comments, and sharing files seamlessly. Receive smart reminders and notifications to never miss a deadline. Integrates with other productivity tools for a unified workspace. TaskMaster also provides analytics and insights to help optimize performance and workflow efficiency. Customize themes, layouts, and notification settings according to your preferences. Ideal for teams, freelancers, and students seeking to boost productivity and streamline daily tasks. Additional features include offline access, cross-device synchronization, and AI-powered task suggestions for enhanced planning.",
        "size": 98,
        "reviews": 1320,
        "ratingAvg": 4.3,
        "downloads": 420000,
        "ratings": [
            {
                "name": "1 star",
                "count": 80
            },
            {
                "name": "2 star",
                "count": 120
            },
            {
                "name": "3 star",
                "count": 300
            },
            {
                "name": "4 star",
                "count": 500
            },
            {
                "name": "5 star",
                "count": 320
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/cSgG3xns/fittrac-Pro.png",
        "title": "FitTrack Pro",
        "companyName": "HealthVision Ltd",
        "id": 2,
        "description": "FitTrack Pro is a comprehensive fitness app designed to help users track workouts, monitor heart rate, count steps, and analyze fitness progress. Personalized AI-based insights provide suggestions to improve workouts and optimize health. Users can set fitness goals, create custom routines, and track nutrition. The app integrates with wearable devices for real-time tracking and health monitoring. Features include activity logs, progress charts, and performance benchmarks. FitTrack Pro also supports social engagement with challenges, leaderboards, and community support. Ideal for beginners and athletes alike, it provides detailed exercise instructions, video tutorials, and health tips. Additionally, users receive alerts for hydration, sleep tracking, and recovery recommendations to maintain overall wellness.",
        "size": 142,
        "reviews": 2890,
        "ratingAvg": 4.6,
        "downloads": 780000,
        "ratings": [
            {
                "name": "1 star",
                "count": 60
            },
            {
                "name": "2 star",
                "count": 110
            },
            {
                "name": "3 star",
                "count": 450
            },
            {
                "name": "4 star",
                "count": 900
            },
            {
                "name": "5 star",
                "count": 1370
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/nqXyXRzq/Note-Scope.jpg",
        "title": "NoteScape",
        "companyName": "BrainWave Apps",
        "id": 3,
        "description": "NoteScape is a minimalist note-taking application for writers, students, and professionals. With support for markdown formatting, users can create well-structured notes, organize them into folders, and sync across devices. Features include rich text editing, cloud backup, and offline access. Users can add images, tables, and code snippets to enhance their notes. NoteScape also offers tagging, search functionality, and customizable themes. Collaborate on shared notes with peers and track changes easily. Its elegant design promotes focus and productivity while providing AI suggestions for summarizing content. Perfect for managing study materials, research, or personal journals. The app includes task integration, reminders, and note version history for comprehensive note management.",
        "size": 68,
        "reviews": 1570,
        "ratingAvg": 4.4,
        "downloads": 330000,
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 400
            },
            {
                "name": "4 star",
                "count": 680
            },
            {
                "name": "5 star",
                "count": 290
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Y77VPnqM/Travel-Buddy.png",
        "title": "TravelBuddy",
        "companyName": "GlobalWander Inc",
        "id": 4,
        "description": "TravelBuddy is your personal travel assistant for planning, booking, and managing trips. Discover destinations, compare flights and hotels, and get intelligent itinerary suggestions. Offline maps, local recommendations, and navigation features ensure seamless travel experiences. Users can create travel journals, share photos, and receive notifications about changes or delays. The app integrates with ride-sharing, public transport, and event booking services. TravelBuddy also offers travel tips, currency converters, and safety alerts. Personalized suggestions based on travel history and preferences help optimize itineraries. Ideal for solo travelers, families, and business travelers. Users can collaborate on trip planning, save favorite destinations, and track expenses within the app. Additional features include language translation, weather updates, and AI-powered trip summaries for hassle-free adventures.",
        "size": 126,
        "reviews": 2420,
        "ratingAvg": 4.5,
        "downloads": 560000,
        "ratings": [
            {
                "name": "1 star",
                "count": 140
            },
            {
                "name": "2 star",
                "count": 210
            },
            {
                "name": "3 star",
                "count": 560
            },
            {
                "name": "4 star",
                "count": 950
            },
            {
                "name": "5 star",
                "count": 560
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/vCHnvzkS/Photo-Master.jpg",
        "title": "PhotoMaster",
        "companyName": "VisualCore Studio",
        "id": 5,
        "description": "PhotoMaster offers professional-grade photo editing tools powered by AI. Enhance photos, correct lighting, remove blurs, and apply artistic filters effortlessly. Users can create collages, add text, and overlay graphics for creative projects. Batch editing allows multiple images to be enhanced simultaneously. Cloud sync ensures access across devices. Social sharing features enable posting directly to platforms or sending to friends. PhotoMaster also includes advanced AI features such as automatic background removal, object detection, and facial touch-up. Perfect for photographers, content creators, and social media enthusiasts. Customize presets, adjust color grading, and export images in various formats. The app combines simplicity with advanced tools to deliver a smooth and professional photo editing experience.",
        "size": 215,
        "reviews": 3030,
        "ratingAvg": 4.8,
        "downloads": 770000,
        "ratings": [
            {
                "name": "1 star",
                "count": 90
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 450
            },
            {
                "name": "4 star",
                "count": 1100
            },
            {
                "name": "5 star",
                "count": 1260
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/nq18syVr/Music-Flow.png",
        "title": "MusicFlow",
        "companyName": "EchoWorks",
        "id": 6,
        "description": "MusicFlow allows streaming and managing music with personalized recommendations. Create playlists, discover new artists, and enjoy offline playback. AI-driven mood analysis provides song suggestions based on current listening habits. High-quality audio, equalizer settings, and cross-device syncing ensure an immersive experience. Users can share music with friends, collaborate on playlists, and follow favorite artists. Podcasts and radio stations are included for added entertainment. MusicFlow tracks listening history and provides insights for better music discovery. The interface is intuitive and visually appealing, with gesture controls and playlist customization. Ideal for music enthusiasts who enjoy exploring genres, curated content, and personalized listening experiences.",
        "size": 178,
        "reviews": 4510,
        "ratingAvg": 4.7,
        "downloads": 1020000,
        "ratings": [
            {
                "name": "1 star",
                "count": 120
            },
            {
                "name": "2 star",
                "count": 180
            },
            {
                "name": "3 star",
                "count": 640
            },
            {
                "name": "4 star",
                "count": 1320
            },
            {
                "name": "5 star",
                "count": 2250
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/FLQzM5Zq/Lang-Learn.jpg",
        "title": "LangLearner",
        "companyName": "Eduverse Tech",
        "id": 7,
        "description": "LangLearner helps users learn new languages through AI-driven lessons and adaptive exercises. Practice speaking, reading, listening, and writing skills interactively. The app pairs learners with conversation partners, provides grammar tips, and tracks progress over time. Personalized exercises target weak areas and reinforce learning efficiently. Features include flashcards, pronunciation checks, and progress analytics. Gamified achievements and daily challenges keep users motivated. Offline access allows continuous practice without internet. LangLearner also supports multilingual dictionaries, phrasebooks, and cultural insights. Ideal for students, travelers, and professionals seeking language proficiency. The platform includes community forums, language exchange programs, and AI tutors for enhanced learning support.",
        "size": 134,
        "reviews": 3890,
        "ratingAvg": 4.6,
        "downloads": 640000,
        "ratings": [
            {
                "name": "1 star",
                "count": 80
            },
            {
                "name": "2 star",
                "count": 150
            },
            {
                "name": "3 star",
                "count": 430
            },
            {
                "name": "4 star",
                "count": 1070
            },
            {
                "name": "5 star",
                "count": 2160
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/rGT17PFt/budget-tracker.png",
        "title": "BudgetTrack",
        "companyName": "SmartFinance Ltd",
        "id": 8,
        "description": "BudgetTrack is a comprehensive financial management app for tracking expenses, setting budgets, and planning savings goals. Monitor daily, weekly, and monthly spending with visual charts and reports. The app automatically categorizes transactions, tracks recurring bills, and identifies overspending habits. Users receive insights, alerts, and suggestions to optimize spending. BudgetTrack allows linking multiple accounts, setting custom notifications, and creating personalized financial goals. Export reports for tax or personal analysis. Integrates with banks and payment platforms for automatic tracking. Provides secure data storage with encryption and multi-device sync. Ideal for individuals, families, and freelancers aiming to manage finances efficiently. Additional features include investment tracking, bill reminders, and goal visualization tools for smarter financial decisions.",
        "size": 105,
        "reviews": 2100,
        "ratingAvg": 4.2,
        "downloads": 290000,
        "ratings": [
            {
                "name": "1 star",
                "count": 120
            },
            {
                "name": "2 star",
                "count": 180
            },
            {
                "name": "3 star",
                "count": 540
            },
            {
                "name": "4 star",
                "count": 950
            },
            {
                "name": "5 star",
                "count": 310
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/4R0gN1bv/healthmate.png",
        "title": "HealthMate",
        "companyName": "WellnessPro",
        "id": 16,
        "description": "HealthMate tracks daily health metrics, including heart rate, sleep patterns, activity levels, and water intake. Set wellness goals and receive personalized recommendations to improve overall health. The app provides detailed analytics, insights, and progress charts. Users can log meals, monitor calories, and track nutritional intake. HealthMate integrates with wearable devices for real-time health monitoring. Offers reminders for medication, hydration, and exercise. Includes mindfulness exercises, guided workouts, and mental health tracking. Ideal for maintaining a balanced lifestyle and preventing health issues. Additional features include custom reports, community support, and motivational achievements. Secure cloud backup ensures data safety, while offline access allows uninterrupted tracking. HealthMate empowers users to take control of their wellness journey.",
        "size": 120,
        "reviews": 2850,
        "ratingAvg": 4.5,
        "downloads": 600000,
        "ratings": [
            {
                "name": "1 star",
                "count": 90
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 500
            },
            {
                "name": "4 star",
                "count": 950
            },
            {
                "name": "5 star",
                "count": 1180
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/1CmDv7B/travel-planer.png",
        "title": "TravelPlanner",
        "companyName": "Wanderlust Inc",
        "id": 17,
        "description": "TravelPlanner is a full-featured trip planning app that helps users organize itineraries, discover local experiences, and book travel essentials. Users can search flights, hotels, attractions, and transportation. Smart recommendations based on preferences, budget, and travel history simplify planning. The app provides offline maps, route planning, weather updates, and safety alerts. TravelPlanner supports collaborative trip planning, allowing friends and family to contribute and share itineraries. Integration with calendars, reminders, and expense tracking ensures smooth travel management. Includes AI-based suggestions for optimizing travel time and activities. Ideal for solo travelers, families, and business trips. Additional features include destination guides, language translation, and travel tips for a seamless experience.",
        "size": 135,
        "reviews": 2480,
        "ratingAvg": 4.6,
        "downloads": 550000,
        "ratings": [
            {
                "name": "1 star",
                "count": 80
            },
            {
                "name": "2 star",
                "count": 120
            },
            {
                "name": "3 star",
                "count": 480
            },
            {
                "name": "4 star",
                "count": 1020
            },
            {
                "name": "5 star",
                "count": 1080
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Rp3xz4GK/foodfinder.png",
        "title": "FoodFinder",
        "companyName": "YummyTech",
        "id": 18,
        "description": "FoodFinder is your go-to app for discovering restaurants, reading reviews, and ordering food with real-time tracking. Users can search by cuisine, location, ratings, or price. The app provides detailed menus, offers, discounts, and delivery options. Real-time order updates and tracking ensure accurate delivery times. FoodFinder supports user reviews, ratings, and photos to help others make informed choices. Integrates with payment platforms for secure and convenient transactions. Personalized recommendations based on preferences, dietary restrictions, and order history enhance the user experience. Ideal for foodies, families, and busy professionals. Additional features include reservation booking, loyalty programs, and social sharing. The app also tracks calories and nutrition for health-conscious users.",
        "size": 140,
        "reviews": 3190,
        "ratingAvg": 4.5,
        "downloads": 750000,
        "ratings": [
            {
                "name": "1 star",
                "count": 100
            },
            {
                "name": "2 star",
                "count": 140
            },
            {
                "name": "3 star",
                "count": 520
            },
            {
                "name": "4 star",
                "count": 1180
            },
            {
                "name": "5 star",
                "count": 1250
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/RpK0s99R/mind-Notes.jpg",
        "title": "MindNotes",
        "companyName": "BrainApps",
        "id": 19,
        "description": "MindNotes is a powerful note-taking and task management app with cloud sync and intuitive interface. Users can create notes, checklists, and reminders with organized folders and tags. MindNotes supports rich text formatting, image embedding, and voice memos. Share notes with colleagues, classmates, or friends for collaboration. The app provides AI suggestions for summarizing notes and highlighting important points. Offline access ensures productivity anywhere. Advanced search and filtering features help find content quickly. Ideal for students, professionals, and teams. MindNotes also includes task tracking, progress charts, and customizable themes. Security features such as password protection and encryption keep sensitive information safe. Notifications and deadlines help users stay organized and focused.",
        "size": 95,
        "reviews": 1720,
        "ratingAvg": 4.3,
        "downloads": 360000,
        "ratings": [
            {
                "name": "1 star",
                "count": 60
            },
            {
                "name": "2 star",
                "count": 90
            },
            {
                "name": "3 star",
                "count": 420
            },
            {
                "name": "4 star",
                "count": 730
            },
            {
                "name": "5 star",
                "count": 420
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/DH72vcjt/quick-Learn.png",
        "title": "QuickLearn",
        "companyName": "EduSmart",
        "id": 20,
        "description": "QuickLearn is an educational app offering skill development, interactive quizzes, and progress tracking. Personalized recommendations help users focus on areas needing improvement. Includes video lessons, exercises, flashcards, and AI-based tutoring for enhanced learning. Users can track achievements, set goals, and receive reminders. Offline mode allows uninterrupted learning anywhere. QuickLearn covers multiple subjects, languages, and professional skills. Gamified challenges and competitions keep engagement high. Integration with calendars and progress reports ensures structured learning. Community forums allow collaboration and discussion. Ideal for students, lifelong learners, and professionals seeking skill enhancement. Additional features include certificate generation, learning analytics, and adaptive difficulty adjustments.",
        "size": 110,
        "reviews": 2540,
        "ratingAvg": 4.5,
        "downloads": 480000,
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 100
            },
            {
                "name": "3 star",
                "count": 450
            },
            {
                "name": "4 star",
                "count": 1020
            },
            {
                "name": "5 star",
                "count": 900
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/wNzm6DYL/photowiz.jpg",
        "title": "PhotoWizard",
        "companyName": "VisualApps",
        "id": 21,
        "description": "PhotoWizard offers professional photo editing tools with AI-assisted filters and enhancements. Users can edit images, apply artistic effects, adjust colors, and remove unwanted objects. The app includes batch processing, cloud sync, and offline access. Ideal for photographers, designers, and social media content creators. PhotoWizard supports layer-based editing, text overlays, and image blending. Export in multiple formats and resolutions. Share directly to social media platforms. Includes tutorials, presets, and customizable filters. AI tools analyze images for optimal enhancement suggestions. Collaborative editing allows team projects. Additional features include facial touch-ups, HDR adjustments, and lens corrections. User-friendly interface ensures both beginners and professionals can achieve desired results easily.",
        "size": 200,
        "reviews": 3100,
        "ratingAvg": 4.7,
        "downloads": 820000,
        "ratings": [
            {
                "name": "1 star",
                "count": 90
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 520
            },
            {
                "name": "4 star",
                "count": 1200
            },
            {
                "name": "5 star",
                "count": 1160
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/ksvc8hFh/musicvibe.png",
        "title": "MusicVibe",
        "companyName": "SoundWave",
        "id": 22,
        "description": "MusicVibe provides seamless music streaming with playlist creation, trending songs discovery, and personalized recommendations. Users can download songs for offline listening, follow artists, and receive notifications for new releases. Mood-based AI playlists enhance music experience. Social sharing, collaborative playlists, and radio stations keep the experience engaging. High-quality audio and equalizer options enhance playback. Integration with smart devices and wearables provides convenience. MusicVibe also tracks listening habits, creates analytics, and suggests new genres. Ideal for music enthusiasts seeking both variety and curation. Additional features include lyrics display, music videos, and podcast integration for an all-in-one audio platform. The interface is sleek, responsive, and easy to navigate.",
        "size": 175,
        "reviews": 4000,
        "ratingAvg": 4.6,
        "downloads": 980000,
        "ratings": [
            {
                "name": "1 star",
                "count": 100
            },
            {
                "name": "2 star",
                "count": 160
            },
            {
                "name": "3 star",
                "count": 600
            },
            {
                "name": "4 star",
                "count": 1300
            },
            {
                "name": "5 star",
                "count": 1840
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/vfvhgsk/travelmate.jpg",
        "title": "TravelMate",
        "companyName": "GlobalTrips",
        "id": 23,
        "description": "TravelMate is your all-in-one travel companion for planning vacations, booking experiences, and exploring local recommendations worldwide. The app helps users search for flights, hotels, restaurants, and attractions with AI-powered suggestions. Trip itineraries can be customized with offline maps, weather updates, and travel alerts. Collaborative planning allows friends and family to contribute and share itineraries. TravelMate tracks expenses, provides currency conversions, and offers travel tips for safety and convenience. Includes reminders for reservations, local events, and transportation schedules. Ideal for solo travelers, families, and business trips. Users can save favorite destinations, track visited places, and share experiences on social media. Additional features include translation support, travel blogs, and community forums for real-time advice.",
        "size": 145,
        "reviews": 2700,
        "ratingAvg": 4.5,
        "downloads": 610000,
        "ratings": [
            {
                "name": "1 star",
                "count": 80
            },
            {
                "name": "2 star",
                "count": 120
            },
            {
                "name": "3 star",
                "count": 500
            },
            {
                "name": "4 star",
                "count": 1000
            },
            {
                "name": "5 star",
                "count": 1200
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/d41jt6jJ/Food-planer.jpg",
        "title": "FoodPlanner",
        "companyName": "MealTech",
        "id": 24,
        "description": "FoodPlanner is a nutrition-focused app for organizing meals, tracking calories, and maintaining a balanced diet. Users can create weekly meal plans, log ingredients, and get recipes tailored to dietary needs. The app calculates nutritional values, tracks macro and micronutrients, and provides AI-based suggestions for healthier options. FoodPlanner integrates with grocery delivery services, allowing users to order ingredients directly. Includes reminders for meal prep, hydration, and dietary goals. Offers personalized insights, progress tracking, and reports for health-conscious users. Ideal for families, fitness enthusiasts, and individuals with dietary restrictions. Users can collaborate with nutritionists, track water intake, and analyze eating patterns. Additional features include recipe sharing, community challenges, and seasonal diet recommendations for sustainable healthy living.",
        "size": 130,
        "reviews": 1980,
        "ratingAvg": 4.4,
        "downloads": 450000,
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 100
            },
            {
                "name": "3 star",
                "count": 420
            },
            {
                "name": "4 star",
                "count": 860
            },
            {
                "name": "5 star",
                "count": 630
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/sYXGCBn/smart-wallet.png",
        "title": "SmartWallet",
        "companyName": "FinTechLabs",
        "id": 25,
        "description": "SmartWallet is a financial management app designed for tracking expenses, managing budgets, and planning future finances efficiently. Users can categorize transactions, set budget limits, and receive alerts when nearing thresholds. SmartWallet provides visual charts, analytics, and insights to optimize spending. It supports multiple accounts, automatic synchronization with bank statements, and secure cloud backups. Users can set financial goals, track savings, and generate reports for personal or tax purposes. Integration with payment apps ensures seamless transactions. Ideal for individuals, freelancers, and families seeking financial clarity. Additional features include investment tracking, recurring payments management, and smart recommendations for improving savings habits. The app also offers encryption and biometric security for sensitive financial data.",
        "size": 110,
        "reviews": 2250,
        "ratingAvg": 4.5,
        "downloads": 540000,
        "ratings": [
            {
                "name": "1 star",
                "count": 80
            },
            {
                "name": "2 star",
                "count": 110
            },
            {
                "name": "3 star",
                "count": 440
            },
            {
                "name": "4 star",
                "count": 950
            },
            {
                "name": "5 star",
                "count": 670
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/KcsgY4ST/book-Tracker.png",
        "title": "BookTracker",
        "companyName": "ReadSmart",
        "id": 26,
        "description": "BookTracker is a reading management app that allows users to track books, join book clubs, and receive personalized book recommendations. Users can log reading progress, rate books, and maintain a digital library. The app includes reading goals, reminders, and challenges to motivate consistent reading habits. BookTracker offers community discussions, reviews, and curated lists based on interests. Ideal for avid readers, students, and book clubs. Users can share achievements, track genres, and explore trending or classic books. Integration with e-readers and audiobooks ensures flexibility. Additional features include highlighting, note-taking, syncing across devices, and AI suggestions for next reads. BookTracker fosters a learning environment while encouraging literary exploration.",
        "size": 100,
        "reviews": 1800,
        "ratingAvg": 4.3,
        "downloads": 370000,
        "ratings": [
            {
                "name": "1 star",
                "count": 50
            },
            {
                "name": "2 star",
                "count": 80
            },
            {
                "name": "3 star",
                "count": 400
            },
            {
                "name": "4 star",
                "count": 700
            },
            {
                "name": "5 star",
                "count": 570
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/FbxHJ84j/learnmate.webp",
        "title": "LearnMate",
        "companyName": "EduTech",
        "id": 27,
        "description": "LearnMate is a versatile online learning platform that provides AI-powered lessons, interactive exercises, and quizzes to develop skills efficiently. Users can track progress, receive personalized recommendations, and explore a variety of courses including languages, professional skills, and creative subjects. The app supports gamified challenges, achievements, and certificates upon course completion. LearnMate includes offline access, progress analytics, discussion forums, and collaborative learning features. Ideal for students, professionals, and lifelong learners seeking flexible, engaging, and structured learning experiences. Integration with calendars and notifications ensures consistent study habits. Additional features include adaptive learning paths, AI tutoring, community mentoring, and resource libraries. LearnMate combines technology and pedagogy to foster effective knowledge acquisition and skill development.",
        "size": 125,
        "reviews": 2400,
        "ratingAvg": 4.6,
        "downloads": 520000,
        "ratings": [
            {
                "name": "1 star",
                "count": 70
            },
            {
                "name": "2 star",
                "count": 110
            },
            {
                "name": "3 star",
                "count": 480
            },
            {
                "name": "4 star",
                "count": 1050
            },
            {
                "name": "5 star",
                "count": 990
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/WvMKy9kC/workout.png",
        "title": "WorkoutPal",
        "companyName": "FitnessHub",
        "id": 28,
        "description": "WorkoutPal is a comprehensive fitness app providing personalized workout routines, performance tracking, and smart analytics. Users can select training plans for strength, cardio, flexibility, or wellness goals. The app offers video tutorials, AI-guided exercises, and progress analytics. Users can track calories burned, exercise frequency, and milestones. WorkoutPal includes challenges, community support, and social sharing to boost motivation. Integration with wearable devices allows real-time monitoring and heart rate tracking. Ideal for beginners, athletes, and fitness enthusiasts seeking structured and adaptable training. Additional features include nutrition tracking, personalized recommendations, recovery reminders, and virtual coaching. WorkoutPal ensures holistic fitness planning with secure data storage and offline accessibility for uninterrupted workouts.",
        "size": 155,
        "reviews": 3100,
        "ratingAvg": 4.7,
        "downloads": 780000,
        "ratings": [
            {
                "name": "1 star",
                "count": 90
            },
            {
                "name": "2 star",
                "count": 130
            },
            {
                "name": "3 star",
                "count": 520
            },
            {
                "name": "4 star",
                "count": 1180
            },
            {
                "name": "5 star",
                "count": 1180
            }
        ]
    }
]